class Caesar:
    alphabet = "яюэьыъщшчцхфутсрпонмлкйизжёедгвба"

    def __init__(self, key):
        self._encode = dict()
        for i in range(len(self.alphabet)):
            letter = self.alphabet[i]
            encoded = self.alphabet[(i - key) % len(self.alphabet)]
            self._encode[letter] = encoded
            self._encode[letter.upper()] = encoded.upper()
        self._decode = {}  # TODO

    def encode(self, text):
        return ''.join([self._encode.get(char, char) for char in text])

    def decode(self, line):
        pass  # TODO


key = int(input('Введите ключ:'))
cipher = Caesar(key)
line = input()
while line:
    print(cipher.encode(line))
    line = input()
"""
Кыжг вгбдебь ътячанВбъцгтфюсчя д гтдкыжгбфэбь гтъцчют!Ыетэ, фн цбхтцтюыдо вбйчяё кыжг Ичътгс ач сфюсчедс эгывебдебьэыя: дюыкэбя ятют яблабдео яабщчдефт эюрйчь ы аёщань эюрй ючхэб атьеы ячебцбя вбюабхб вчгчубгт.Ябщаб юы ёфчюыйыео эгывебдебьэбдео, ач ячасс ячебц кыжгбфтаыс? Цт, ябщаб. Чдюы ътячасео бцыа дыяфбю тюжтфыет ат бвгчцчюшаань цгёхбь дыяфбю ебхб щч тюжтфыет вб этэбь-еб етуюыич ътяча, еб дтят етуюыит ътяча ы сфюсчедс эюрйбя.|т|у|ф|х|ц|ч|ш|щ|ъ|ы|ь|э|ю|я|а|б|в|г|д|е|ё|ж|з|и|й|к|л|м|н|о|п|р|с||о|ъ|и|ф|э|у|л|з|ж|в|г|с|ю|п|т|ч|н|к|ё|я|м|щ|ш|б|х|ь|а|ц|ы|е|й|р|д|Яабщчдефб эюрйчь — пеб яабщчдефб фбъябщанз етуюыи вгбденз ътяча. Цюс гёддэбхб тюжтфыет яблабдео яабщчдефт етуюыи вгбденз ътяча гтфат жтэебгытюё бе 33. 33! = 8683317618811886495518194401280000000Чдюы етеыео ат вгбфчгэё бцабхб фтгытает 0.000001 дчэёацн, вбюёйыедс 2.8e+23 юче. Ябщче вбэтътеодс, йеб кыжг вгбдебь ътячан фвбюач эгывебдебьэыь, бцатэб пеб ач етэ.Чхб цбдетебйаб вгбдеб фъюбятео вгы вбяблы йтдебеабхб татюыът. Цчюб ф ебя, йеб йтдебет вбсфючаыс ътцтаабь уёэфн тюжтфыет ф цбдетебйаб цюыаанз ечэдетз бцат ы ет щч цюс гтъанз ечэдебф бцабхб сънэт. Чдюы ф кыжгбечэдеч уёцче дыяфбю д фчгбсеабдеор вбсфючаыс, татюбхыйабь детацтгеабь цюс сънэт, еб ябщаб вгчцвбюбщыео, йеб ба ы сфюсчедс ёэтътаабь ъткыжгбфтаабь уёэфбь.Ячебц йтдебеабхб эгывебтатюыът ыъфчдеча д IX-хб фчэт, збес атыубючч ыъфчдеаня дюёйтчя чхб вгыячачаыс ф гчтюоабь щыъаы, фбъябщаб, сфюсчедс цчкыжгбфэт чхывчедэыз ычгбхюыжбф ф 1822 хбцё.Ыетэ, дючцёрлтс йтдео гтубен ъткыжгбфтат вгы вбяблы дючцёрлчь вгбхгтяян:
"""
"""
|т|у|ф|х|ц|ч|ш|щ|ъ|ы|ь|э|ю|я|а|б|в|г|д|е|ё|ж|з|и|й|к|л|м|н|о|п|р|с||о|ъ|и|ф|э|у|л|з|ж|в|г|с|ю|п|т|ч|н|к|ё|я|м|щ|ш|б|х|ь|а|ц|ы|е|й|р|д|
"""